#### Import արեք pandas գրադարանը pd  անունով

In [1]:
import pandas as pd

### Import the dataset baby_names.txt, assign it to a variable called baby_names

### Import արեք baby_names.txt dataset-ը ու այն վերագրեք baby_names փոփոխականի

In [2]:
baby_names = pd.read_csv("baby_names.csv")

### See the first 10 entries.

### Տպեք առաջին 10 արժեքը

In [16]:
baby_names.head(10)
# baby_names.tail()

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Delete the columns 'Unnamed: 0' and 'Id'

### Ջնջեք 'Unnamed: 0' ու 'Id' սյուները

In [4]:
# baby_names.drop(['Unnamed: 0', 'Id'], axis=1)

baby_names_1 = baby_names.drop(columns=['Unnamed: 0', 'Id'], inplace=False)
baby_names_1.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Are there more male or female names in the dataset?

### Արդյոք dataset-ում ավելի շատ են կանացի թե տղամարդու անունները?

In [5]:
baby_names['Gender'].value_counts(ascending=True)

M      99
F    2404
Name: Gender, dtype: int64

### Delete the column 'Year'. Group the dataset by name and assign to names.

### Ջնջեք 'Year' սյունը. Խմբավորեք dataset-ը ըստ անունի ու վերագրեք արդյունքը names փոփոխականին

In [6]:
baby_names_2 = baby_names_1.drop(columns=['Year'])
baby_names_2.head()

# names = baby_names_2.groupby('Name').size()
names = baby_names_2.groupby('Name')
names.tail()

          Name Gender State  Count
56       Jamie      F    AK     13
69       Malia      F    AK     12
74    Michelle      F    AK     11
79     Katrina      F    AK     10
82      Amanda      F    AK      9
...        ...    ...   ...    ...
2498     Devin      M    AK     12
2499      Liam      M    AK     12
2500      Paul      M    AK     12
2501   Richard      M    AK     12
2502   Trenton      M    AK     12

[1724 rows x 4 columns]

### How many different names exist in the dataset?

### Քանի հատ տարբեր անուն կա dataset-ում?

In [7]:
# baby_names_2['Name'].count()
# baby_names_2[baby_names_2.columns[0]].count()
# len(baby_names_2.index)
# baby_names_2.shape[0]

count = len(names)
print(count)

575

### What is the name with most occurrences?

### Որն է ամենաշատ հանդիպող անունը?

In [8]:
name_freqs = baby_names_2['Name'].value_counts(sort=True, ascending=False)
print( next( iter(name_freqs.items()) ) )

('Riley', 12)

### What is the median name occurrence?

### Որն է անունների հանդիպման մեդիանը՞

In [9]:
names.median()

         Count
Name
Aaliyah   11.0
Aaron     29.0
Abby       6.0
Abigail   37.0
Ada        5.0
...        ...
Wyatt     20.0
Xander    13.0
Zachary   27.0
Zoe       15.0
Zoey      12.0

[575 rows x 1 columns]

### Get a summary with the mean, min, max, std and quartiles.

### Ստացեք dataset-ի ամփոփում mean, min, max, std ու quartile-ներով

In [55]:
print(f"Mean is: {baby_names_2.mean(numeric_only=True)} \n")
print(f"Min is: {baby_names_2.min(numeric_only=True)} \n")
print(f"Max is: {baby_names_2.max(numeric_only=True)} \n")
print(f"Std is: {baby_names_2.std(numeric_only=True)} \n")
print(f"Quantile 0.25 is: {baby_names_2.quantile(0.25)} \n")
print(f"Quantile 0.5 is: {baby_names_2.quantile()} \n")
print(f"Quantile 0.75 is: {baby_names_2.quantile(0.75)} \n")

# baby_names_2.describe()

Mean is: Count    11.485018
dtype: float64

Min is: Count    5
dtype: int64

Max is: Count    65
dtype: int64

Std is: Count    8.830294
dtype: float64

Quantile 0.25 is: Count    6.0
Name: 0.25, dtype: float64

Quantile 0.5 is: Count    8.0
Name: 0.5, dtype: float64

Quantile 0.75 is: Count    13.0
Name: 0.75, dtype: float64